app/controllers/admin/hulls_controller.rb

  def show
    @hull = Hull.find params[:id], :include => [:manufacturers, :properties]
---
SELECT * FROM `hulls` WHERE (`hulls`.`id` = 10)
SELECT `manufacturers`.*, t0.hull_id as the_parent_record_id FROM `manufacturers` INNER JOIN `hulls_manufacturers` t0 ON `manufacturers`.id = t0.manufacturer_id WHERE (t0.hull_id = 11)
SELECT `properties`.*, t0.hull_id as the_parent_record_id FROM `properties` INNER JOIN `hulls_properties` t0 ON `properties`.id = t0.property_id WHERE (t0.hull_id = 11)

  def save
    id = params['hull']['id']
    hull = Hull.find id, :include => [:properties, :manufacturers]

    params[:material] = params[:hull][:material]
    params[:hull].delete(:material)

    params[:mover_type] = params[:hull][:mover_type]
    params[:hull].delete(:mover_type)

    params[:deck_type] = params[:hull][:deck_type]
    params[:hull].delete(:deck_type)

    params[:transom_height] = params[:hull][:transom_height]
    params[:hull].delete(:transom_height)

    hull.update_attributes(params['hull'])
    if hull.valid?
      unless params[:manufacturer].blank?
        mfg = params[:manufacturer].to_s.to_slug
        found = Manufacturer.find_by_slug mfg
---
SELECT * FROM `hulls` WHERE (`hulls`.`id` = 14)
SELECT `manufacturers`.*, t0.hull_id as the_parent_record_id FROM `manufacturers` INNER JOIN `hulls_manufacturers` t0 ON `manufacturers`.id = t0.manufacturer_id WHERE (t0.hull_id = 11)
SELECT `properties`.*, t0.hull_id as the_parent_record_id FROM `properties` INNER JOIN `hulls_properties` t0 ON `properties`.id = t0.property_id WHERE (t0.hull_id = 11)
UPDATE `hulls` SET `updated_at` = '2010-03-06 11:08:15', `length` = 3.0, `width` = 4.0 WHERE `id` = 11
SELECT * FROM `manufacturers` WHERE (`manufacturers`.`slug` = 'eastmarine') LIMIT 1

  def delete
    Hull.delete params[:id]
---
DELETE FROM `hulls` WHERE (`id` IN ('10'))