app/controllers/admin/index_controller.rb

SELECT * FROM `hulls` WHERE (original_id IS NULL) ORDER BY created_at DESC
SELECT * FROM `manufacturers`
---
  def index
    @hulls = Hull.all :conditions => 'original_id IS NULL', :order => 'created_at DESC'

    @manufacturers = Manufacturer.all