app/controllers/admin/manufacturers_controller.rb

  def show
    @mfg = Manufacturer.find(params[:id])
---
SELECT * FROM `manufacturers` WHERE (`manufacturers`.`id` = 2)

  def save

    @mfg = Manufacturer.find params[:manufacturer][:id]
    if @mfg.update_attributes params[:manufacturer]
---
SELECT * FROM `manufacturers` WHERE (`manufacturers`.`id` = 2)
UPDATE `manufacturers` SET `updated_at` = '2010-03-23 18:05:40', `slug` = 'eastmarine-huy', `name` = 'Eastmarine хуй' WHERE `id` = 2