app/controllers/hulls_controller.rb

SELECT * FROM `manufacturers`
SELECT * FROM `manufacturers` WHERE (`manufacturers`.`slug` = 'eastmarine') LIMIT 1
INSERT INTO `hulls` (`name`, `slug`, `price`, `original_id`, `created_at`, `deadrise`, `power_min`, `updated_at`, `weight`, `mover_type_id`, `url`, `reviewed`, `height`, `length`, `description`, `configuration`, `width`, `power_max`) VALUES('hjfyjy', 'hjfyjy', NULL, NULL, '2010-03-13 20:46:52', NULL, NULL, '2010-03-13 20:46:52', NULL, NULL, '', 0, NULL, 6.3, '', '', NULL, NULL)
INSERT INTO `manufacturers` (`slug`, `name`, `created_at`, `updated_at`, `url`, `description`) VALUES(NULL, '--- !map:HashWithIndifferentAccess \nname: !binary |\n 0JHRgNC40LcgMjM=\n\nprice: \"\"\npower_min: \"\"\ndeadrise: \"\"\nweight: \"\"\nurl: \"\"\nid: \"\"\nheight: \"\"\nlength: \"\"\ndescription: \"\"\nconfiguration: \"\"\nwidth: \"\"\npower_max: \"\"\n', '2010-02-05 15:59:53', '2010-02-05 15:59:53', NULL, NULL)
---
  def create

		if (Time.now - session[:new_hull_form]) < 11
			redirect_to :action => :new
			return
		end

    params[:material] = params[:hull][:material]
    params[:hull].delete(:material)

    params[:mover_type] = params[:hull][:mover_type]
    params[:hull].delete(:mover_type)

    params[:deck_type] = params[:hull][:deck_type]
    params[:hull].delete(:deck_type)

    params[:transom_height] = params[:hull][:transom_height]
    params[:hull].delete(:transom_height)

    @hull = Hull.new(params[:hull].fix_commas)

    if @hull.valid?

      unless params[:manufacturer].blank?
        mfg = params[:manufacturer].to_s.to_slug
        found = Manufacturer.find_by_slug mfg
        found = Manufacturer.new(:name => params[:manufacturer]) if found.nil?
        @hull.manufacturers << found

SELECT * FROM `hulls` WHERE (`hulls`.`slug` = 'briz-17') LIMIT 1
SELECT `images`.* FROM `images` WHERE (`images`.hull_id = 8)
SELECT `manufacturers`.*, t0.hull_id as the_parent_record_id FROM `manufacturers` INNER JOIN `hulls_manufacturers` t0 ON `manufacturers`.id = t0.manufacturer_id WHERE (t0.hull_id = 8)
SELECT `properties`.*, t0.hull_id as the_parent_record_id FROM `properties` INNER JOIN `hulls_properties` t0 ON `properties`.id = t0.property_id WHERE (t0.hull_id = 8)
---
  def show

    slug = params[:id]

    @hull = Hull.find_by_slug slug, :include => [:manufacturers, :properties, :images]

    if @hull.nil?
      flash[:error] = "Такого корпуса еще нет или страница была удалена."
      redirect_to '/'
    end

    @title = @hull[:name] + ' - ' + @hull.manufacturers.collect { |mfg| mfg[:name]}.join(', ')