app/controllers/index_controller.rb

SELECT * FROM `hulls` WHERE (reviewed = 1) ORDER BY updated_at DESC LIMIT 10
---
  def index

    @search = Search.new

    @last = Hull.all :order => 'updated_at DESC', :limit => 10, :conditions => ["reviewed = 1"]

SELECT * FROM `manufacturers`
---
  def forward

    query = {}

    acceptable = ['power', 'deadrise', 'length', 'weight', 'height', 'width', 'mover_type', 'deck_type', 'material', 'transom_height', 'manufacturer', 'configuration']

    params.each_pair do |key, value|

      next unless acceptable.include?(key)