app/controllers/manufacturers_controller.rb

  def show
    @mfg = Manufacturer.find_by_slug params[:id], :include => {:hulls => :properties}
    if @mfg.nil?
      flash[:error] = "Этого производителя еще нет в нашей базе."
      redirect_to '/'
    end

    @title = @mfg[:name] + ' - ' + @mfg.hulls[0..2].collect{|hull| hull[:name]}.join(', ')
---
SELECT * FROM `manufacturers` WHERE (`manufacturers`.`slug` = 'eastmarine') LIMIT 1
SELECT `hulls`.*, t0.manufacturer_id as the_parent_record_id FROM `hulls` INNER JOIN `hulls_manufacturers` t0 ON `hulls`.id = t0.hull_id WHERE (t0.manufacturer_id = 2)
SELECT `properties`.*, t0.hull_id as the_parent_record_id FROM `properties` INNER JOIN `hulls_properties` t0 ON `properties`.id = t0.property_id WHERE (t0.hull_id IN (11,12,14,17))