app/controllers/search_controller.rb

      end
    end

    unless @params['manufacturer'].blank?
---
SELECT * FROM `manufacturers`


    sql << " GROUP BY h.id "

    sql << 'HAVING ' + Hull.send(:sanitize_sql_for_conditions, [where[0].join(' AND ')] + where[1]) if where[0].size > 0
---
SELECT * FROM `hulls`


    properties = {}

    Property.all.each do |pp|
---
SELECT * FROM `properties` WHERE ( (`properties`.`type` = 'TransomHeight' ) ) ORDER BY title ASC