app/controllers/sitemap_controller.rb

  def index

    @sitemap = []

    @sitemap << {
        :loc => '/',
        #:lastmod => hull[:updated_at],
        :changefreq => 'daily',
        :priority => 0.9
        }

    Hull.all.each do |hull|
      @sitemap << {
        :loc => '/hulls/'+hull[:slug]+'/',
        #:lastmod => hull[:updated_at],
        :changefreq => 'daily',
        :priority => 0.7
        }
    end

    Manufacturer.all.each do |mfg|
---
SELECT * FROM `hulls`
SELECT * FROM `manufacturers`